[
  {
    "title": "Looking for a security camera that can run off a power bank",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lxvi19/looking_for_a_security_camera_that_can_run_off_a/",
    "author": "u/WhatThisGirlSaid",
    "timestamp": "2025-07-12T08:30:44.224Z",
    "flair": null,
    "post_text": "I have a romoss sense 8p 30,000mah that I run some closet motion sensor lights for the front door and wondering if there is a cheap security camera I can attach to that just for simple motion detection people detection purely for delivery notification nothing else.. No other features needed besides maybe night detection No recording or two way talk or any other fancy features required Just looking for the cheapest camera with no subscription fee required to notify me when someone opens my door to leave food inside the front door on my phone and desktop pc There is no nearby mains power to the door unless I run an obstructive extension cable that's why trying to find a camera that can already use an existing power bank there",
    "author_id": 0,
    "timestep": 3
  },
  {
    "title": "Discreet visual and audio camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lxlesm/discreet_visual_and_audio_camera/",
    "author": "u/lucybashh",
    "timestamp": "2025-07-11T23:16:15.086Z",
    "flair": null,
    "post_text": "Hi everyone, Can anyone please recommend a small spy camera that I can put anywhere in my front room that looks like an ornament, something no one wouldn’t notice at all if they looked twice at it? One preferably that would only start recording if there was movement / sound and is a USB to wall plug chargeable that comes with an app i can downloaded to an app on my phone to save videos? Thank you x",
    "author_id": 1,
    "timestep": 3
  },
  {
    "title": "Need long distance NV security camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwxz7y/need_long_distance_nv_security_camera/",
    "author": "u/goober2199",
    "timestamp": "2025-07-11T04:43:01.066Z",
    "flair": null,
    "post_text": "Hello. Im looking for a security camera to watch over my garden. I want it to have good night vision because that is when it's most vulnerable. I would need 100+ feet clear Night vision. Wifi, good battery / solar. I've been researching and looking online but im getting overwhelmed with all the options. Any insight is appreciated, thank you",
    "author_id": 2,
    "timestep": 2
  },
  {
    "title": "Solar & Cellular Outdoor Cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwwaco/solar_cellular_outdoor_cameras/",
    "author": "u/Relevant_Act2046",
    "timestamp": "2025-07-11T03:12:58.069Z",
    "flair": null,
    "post_text": "I’m looking for an outdoor surveillance camera that would be good for a remote setting. No wifi is available on this site and neither is electricity so I think a solar/cellular camera may be the best fit for this kind of application. Please advise if you have another suggestion. I know of Reolink and have installed a couple previously but their PIR motion detection isn’t the best and their night vision is worse. What other brands or models of cameras would you recommend for this kind of application? Requirements: Reasonably priced Solar powered Cellular based Decent night vision and motion detection.",
    "author_id": 3,
    "timestep": 2
  },
  {
    "title": "Can anyone identify this security camera?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwuxxm/can_anyone_identify_this_security_camera/",
    "author": "u/Aviorwolf",
    "timestamp": "2025-07-11T02:06:44.700Z",
    "flair": null,
    "post_text": "My neighbor put this up pointing at my backyard. Sorry for the poor photo quality! https://preview.redd.it/can-anyone-identify-this-security-camera-v0-2w0joshwk5cf1.jpg",
    "author_id": 4,
    "timestep": 2
  },
  {
    "title": "wifi mini hidden spy camera wireless hd 1080p",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwrmfu/wifi_mini_hidden_spy_camera_wireless_hd_1080p/",
    "author": "u/RepeatPlayful3779",
    "timestamp": "2025-07-10T23:27:47.694Z",
    "flair": null,
    "post_text": null,
    "author_id": 5,
    "timestep": 2
  },
  {
    "title": "Lorex security cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwqn3a/lorex_security_cameras/",
    "author": "u/EmeraldFireWolf",
    "timestamp": "2025-07-10T22:45:32.848Z",
    "flair": null,
    "post_text": "So recently I have been having issues with the people my kids find themselves around so I am looking into a security camera system. Thst I can expand upon. I am looking at the lorex brand but want more people's opions on this company and possible alternatives if it turns out that this isnt the right pick for me. Any information would be amazing.",
    "author_id": 6,
    "timestep": 2
  },
  {
    "title": "24/7 Video recording review/“scrubbing”",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwjtvf/247_video_recording_reviewscrubbing/",
    "author": "u/yanksfold",
    "timestamp": "2025-07-10T18:12:01.934Z",
    "flair": null,
    "post_text": "Is there a quality system that has ability to do “scrubbing” for review of video (vs viewing recorded clips)? Nest does it well but I would prefer anything but Google!",
    "author_id": 7,
    "timestep": 1
  },
  {
    "title": "Our AirBnb has these throughout the home with privacy shield open - what are they and how to tell if these are live?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwghes/our_airbnb_has_these_throughout_the_home_with/",
    "author": "u/BitcoinRigNoob",
    "timestamp": "2025-07-10T16:01:46.742Z",
    "flair": null,
    "post_text": null,
    "author_id": 8,
    "timestep": 1
  },
  {
    "title": "Mobotix jpg url on newer models Mx-VB1A-8-IR-VA",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwf388/mobotix_jpg_url_on_newer_models_mxvb1a8irva/",
    "author": "u/smhick",
    "timestamp": "2025-07-10T15:06:45.331Z",
    "flair": null,
    "post_text": "We recently purchased a new Mx-VB1A-8-IR-VA and we were wondering how we can grab a still jpg image from the camera. On our older Mobotix M15 camera we just used the following URL http://192.168.1.1/record/current.jpg and we see a still image from the camera But testing this on the new Mx-VB1A-8-IR-VA camera doesn't seem to work New camera IP is 192.168.1.2 Tested http://192.168.1.2/record/current.jpg and get the following error Access Error: 404 -- Not Found I'm able to open up the mjpeg live stream no problem via the following URL",
    "author_id": 9,
    "timestep": 1
  },
  {
    "title": "PoE doorbell cameras options",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwef1q/poe_doorbell_cameras_options/",
    "author": "u/WishboneTemporary232",
    "timestamp": "2025-07-10T14:39:26.577Z",
    "flair": null,
    "post_text": "Looking for a PoE doorbell camera. Are there any other options aside from Reolink? Hoping to use with my Swann NVR.",
    "author_id": 10,
    "timestep": 1
  },
  {
    "title": "Simple live camera suggestions?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lw56xs/simple_live_camera_suggestions/",
    "author": "u/KarnifalChimera",
    "timestamp": "2025-07-10T05:57:15.117Z",
    "flair": null,
    "post_text": "Alright, I think this is the right place to ask this? I'm trying to find a basic camera to monitor my barn. I don't need any audio features, absolutely don't want to deal with a subscription, don't really need it to record anything. I just need to be able to look in frequently to check on them without walking out there at all hours, especially when I have girls expecting babies. Night vision would be important but motion detection is not, the animals would set it off every few minutes and that seems silly. It would be technically indoors (the barn is a concrete block building but it does have little screened vents at the top and bottom of two walls) so it won't get wet but it could get cold (just above freezing at the lowest). There is power out there in the form of a regular outlet (I run ac and fans in the summer) so I'd prefer a wired camera. The wifi does just about reach I believe but doing high demand things like video calls in there has had some crunchiness. I imagine that if its just sending video out, no audio, and not receiving anything back it should work? I'd look into cellular but I have a feeling that would be more expensive and I'm on a tighter budget with this.",
    "author_id": 11,
    "timestep": 1
  },
  {
    "title": "Altered with security cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lw2uis/altered_with_security_cameras/",
    "author": "u/chronosthetitan",
    "timestamp": "2025-07-10T03:41:33.905Z",
    "flair": null,
    "post_text": "I’ll be on my app and hear from the cameras but if you save the footage there’s no sound. Sometimes the cameras go out. Am I being WiFi jammed?",
    "author_id": 12,
    "timestep": 1
  },
  {
    "title": "Best Way to Share Tapo C402 Camera Access with Immediate Family",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvxjy9/best_way_to_share_tapo_c402_camera_access_with/",
    "author": "u/bbgarnett",
    "timestamp": "2025-07-09T23:21:52.930Z",
    "flair": null,
    "post_text": "I just ordered two TP-Link Tapo SolarCam C402 Kits and they’ll be arriving next week. Will be using them strictly with a Micro SD card and no cloud storage. We're planning to install them at our family cabin so everyone can keep an eye on the place when we’re not there—mainly to monitor the garden, lake area, and any animals that might be getting into things. I was wondering if there’s any way to set the cameras up so I can give people a link to view the feed, without requiring everyone to download the Tapo app. Ideally, I’d like it to be “public” in the sense that it's easily accessible (like via a URL), but still —not just anyone with the link. If that’s not possible, is there at least a way for multiple people to have their own Tapo accounts and log in to view the cameras and or get notifications? Just looking for the simplest way to share access with family without making it a hassle. Thanks!",
    "author_id": 13,
    "timestep": 1
  },
  {
    "title": "Continuous Live Stream Help",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvt7xy/continuous_live_stream_help/",
    "author": "u/InsignificantUnit137",
    "timestamp": "2025-07-09T20:21:26.991Z",
    "flair": null,
    "post_text": "Hi everyone! I need some help. I work at a mall and we recently got a rooftop beehive. My boss wants a continuous live stream of the beehive to stream to a TV on the mall floor. The problem is that we don’t have a computer to run the stream so we need the feed to go from the camera straight to the TV somehow. We can buy a smart TV and weatherproof camera but are at a loss on what to get and how to actually set it up. None of us are very tech savvy, we just want a way to watch our bees! Any help is very appreciated!!! Thank you!",
    "author_id": 14,
    "timestep": 0
  },
  {
    "title": "Blink outdoor 3/4 the right option?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvr9x1/blink_outdoor_34_the_right_option/",
    "author": "u/Jay20W",
    "timestamp": "2025-07-09T19:04:44.081Z",
    "flair": null,
    "post_text": "A friend of mine would like to put in some outdoor security at her barn. She’s looking to put in about 6 cameras total, all outside covering the exterior and pathways to her barn (she boards and trains horses) I was thinking she might like the Blink outdoor cameras because they are relatively simple, WiFi, enabled, motion activated and have IR for night time. My only concern is battery life. Trying to keep the overall bill under $500 and open to recommendations",
    "author_id": 15,
    "timestep": 0
  },
  {
    "title": "Non-subscription, closed network options?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvq24i/nonsubscription_closed_network_options/",
    "author": "u/WARowland",
    "timestamp": "2025-07-09T18:17:26.916Z",
    "flair": null,
    "post_text": "Looking for a home system with wireless cameras, but that I can set up without an internet connection? Just not sure if there's anything out there like it. Basically, is there a system that let's me connect the cameras to a non-internet wifi network (basically a router with no-modem) and transfer footage to an offline central storage hub that way (like an computer or harddrive also on the network) Would a normal wifi-camera set up allow me to do that? Sorry if the question doesn't quite make sense. Im just not familiar enough with the industry to know what terminology to even look for. I've been hesitant to look at home secuirty systems because I don't like the idea of someone potentially being able to get into my home Internet wifi, and access the system from the internet (yes, I'm paranoid).",
    "author_id": 16,
    "timestep": 0
  },
  {
    "title": "Wireless/Solar + 4G/LTE Outdoor Security Cameras for 5-Building Industrial Park – Recommendations?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvmgnx/wirelesssolar_4glte_outdoor_security_cameras_for/",
    "author": "u/Hungry_Coconut930",
    "timestamp": "2025-07-09T15:57:42.481Z",
    "flair": null,
    "post_text": "We’ve looked at Reolink Go/Go PT Plus, Arlo Go 2, and Eufy 4G Cam S330, but real-world feedback would help. Budget is flexible for reliability. What works well for you? We would need roughly 4-6 cameras. Thanks in advance!",
    "author_id": 17,
    "timestep": 0
  },
  {
    "title": "Camera detected motion at night and I’m paranoid af",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lva66i/camera_detected_motion_at_night_and_im_paranoid_af/",
    "author": "u/Scared_Ad_8772",
    "timestamp": "2025-07-09T04:54:08.119Z",
    "flair": null,
    "post_text": "Long story short I had a pet camera (cheap from Amazon) downstairs for my foster dog. Now it’s my first night without my foster dog and I didn’t unplug the camera downstairs because I didn’t think of it. Right before I go to sleep I check my notifications and it says motion detected and I immediately start shaking while trying to open the app. Then the app just doesn’t work!🥲 it won’t show me the live feed just keeps buffering on a frozen image of downstairs. Granted it does say expired but I didn’t think I had to have a plan. It’s boykeep from Amazon super cheap it’s also sitting on the floor so if someone could tell me it was most likely a bug that would be appreciated because I’m paralyzed with fear locked in my room for the last hour when I should be sleeping. I locked all doors like always and keep my porch light on. I hate being alone, I miss my foster. Someone please tell me I’m overreacting and to go to sleep. Thanks.",
    "author_id": 18,
    "timestep": 0
  },
  {
    "title": "Recommendations",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv673r/recommendations/",
    "author": "u/rvallo22",
    "timestamp": "2025-07-09T01:25:52.405Z",
    "flair": null,
    "post_text": "Looking for recs on security cameras. Currently new build, roughly 6,000 sq ft finished on 3.5 acres. Looking for recs on cameras. Planning on doing an Orbi 970 mesh network for wifi, electrician will run CAT 6 for cameras. Ideally would like local storage without monthly fee. Have looked at several, confused regarding PoE switch necessary? Thanks!",
    "author_id": 19,
    "timestep": 0
  },
  {
    "title": "Parked car wireless security camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv552o/parked_car_wireless_security_camera/",
    "author": "u/Exotic_Dig2773",
    "timestamp": "2025-07-09T00:34:25.484Z",
    "flair": null,
    "post_text": "My daughter’s car has gotten keyed a couple times. First time was able to buff out second time had the doors repainted. We are pretty sure we know who is doing this, but need some proof. I’m wondering if there are some decent inexpensive wireless cameras that could do this. At this point, I’m a bit overwhelmed trying to find what I’m looking for. She doesn’t need a dash cam system just looking for some thing that is wireless and can record at night when it’s parked, hopefully that has motion detection so it doesn’t wear out the battery life. I could also buy a battery pack or another source of power as well. Her cigarette lighter does not work when her car is turned off.",
    "author_id": 20,
    "timestep": 0
  },
  {
    "title": "Business cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv4h4x/business_cameras/",
    "author": "u/Ok_Worldliness4413",
    "timestamp": "2025-07-09T00:03:04.960Z",
    "flair": null,
    "post_text": "Does anyone know of a camera system that will allow multiple people to view at the same while not having control? I’m planning on providing my boarders/clients access to view their horses on camera while in their turnout. But I don’t particularly want my clients watching me after hours fixing a fence or scooping poo in my sports bra etc. so the ability to turn off their access is a must. Also the ability to completely take away their access all together if they leave and move their horse to a different property.",
    "author_id": 21,
    "timestep": 0
  },
  {
    "title": "Best Budget Battery Security Cams for Prime Day? (No Wiring Needed)",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv1x30/best_budget_battery_security_cams_for_prime_day/",
    "author": "u/No-Structure828",
    "timestamp": "2025-07-08T22:09:59.273Z",
    "flair": null,
    "post_text": "Hey all, Just moved into a new place and I’m looking for 2–3 budget-friendly, battery-powered security cameras ideally from a decent brand. I really don’t want to mess with wiring, so wireless/battery is a must for me. My main goal is to cover the cars and the back door, which faces a busy estate walkway (looooots of kids and dog walkers). Since it’s Prime Day, I’d like to snag a deal if possible. I’m currently eyeing the TP-Link Tapo TC82 and TC85 (2K battery cams), they seem decent for the price. I used Reolink before (wired, though), and was thinking maybe add the TD21 Tapo video doorbell as well. Also noticed some Eufy cams on sale.",
    "author_id": 22,
    "timestep": 0
  }
]