[
  {
    "title": "Recomendation for DVR using Trackmix wifi.",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2rv3p/recomendation_for_dvr_using_trackmix_wifi/",
    "author": "u/u_siciliano",
    "timestamp": "2025-07-18T03:32:49.129Z",
    "flair": null,
    "post_text": "Somebody suggested recently on another post, but can’t find. I need a recommendation for a DVR using a few Trackmix wifi to record 27/4 (i use people/car detection on SD right now) with possible expansion for POE in the future. Also does the Trackmix wifi run POE on it’s ethernet port? Jw. Last, i think not but asking. Do they make one that connects over wifi to router? It would help with cabling restrictions at this time. Thanks",
    "score": null,
    "comments_count": null
  },
  {
    "title": "LTS camera adjustment",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2rqlt/lts_camera_adjustment/",
    "author": "u/BloodyNightwalker",
    "timestamp": "2025-07-18T03:26:18.848Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Aosu cameras connecting to monitor.",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2qp35/aosu_cameras_connecting_to_monitor/",
    "author": "u/Mike-huntts",
    "timestamp": "2025-07-18T02:33:49.177Z",
    "flair": null,
    "post_text": "Anyone have any idea how I can connect my aosu cameras to a computer monitor? Want to have it continuously running beside my tv with the cameras up.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Ring Camera hacked?!",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2nz8s/ring_camera_hacked/",
    "author": "u/Ok_Accountant_4954",
    "timestamp": "2025-07-18T00:23:39.883Z",
    "flair": null,
    "post_text": "I saw a TikTok video of a woman explaining how her Ring camera was hacked on May 28th. Several people in the comments also had devices accessing their cameras on the same day. I checked mine and had 4 UNAUTHORIZED devices accessing my cameras that day. Has anyone heard about this?! Was there a glitch in the system or something or is this legit?!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Whats wrong",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2lkgu/whats_wrong/",
    "author": "u/cashma352",
    "timestamp": "2025-07-17T22:36:10.145Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Hiseeu",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2emco/hiseeu/",
    "author": "u/jnctx2020",
    "timestamp": "2025-07-17T18:02:47.930Z",
    "flair": null,
    "post_text": "Hello we just purchased a hiseeu system for our business and the led lights we have a affecting the cameras so that black lines are running through the screen. Anyone know what I can do to fix this or a similar system that will work. Our older revo system works fine with the lights but it's from 2008 and needs replacing. Any help would be great thank you",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Looking for wireless, solar, no subscription security camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2dp4v/looking_for_wireless_solar_no_subscription/",
    "author": "u/Spetz",
    "timestamp": "2025-07-17T17:27:55.212Z",
    "flair": null,
    "post_text": "I’m looking for a wireless security camera for the side of my house. The plan is to have the camera sit behind a motion activated security light from Sansi as a deterrent. Criteria:\nNo monthly subscription – critical\nApplication or browser controlled, but the application must not have subscription fee based options, because this means that the default option without subscription is not good enough.\nSolar powered",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Help document emotional abuse in Texas",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2d4x8/help_document_emotional_abuse_in_texas/",
    "author": "u/mugskitten",
    "timestamp": "2025-07-17T17:06:35.965Z",
    "flair": null,
    "post_text": "Hi, I am working to try and find a camera that will accurately record situations in my house. My stbx husband is extremely volatile and emotionally abusive, screaming, broken furniture, a broken window, doors, punched holes in walls ect. My current blink cameras are notorious for not activating when motion is sensed right away so a lot is missed. I have filed for divorce, just waiting for him to be served, if it was just me I would just leave, but I have 4 kids, one works locally, and school starts in a few weeks, and we have 2 ferrets, and 8 cats whom he has threatened to kill. So please help me find a c camera solution that I can document this for court.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Security Camera Recommendations",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m2a6wv/security_camera_recommendations/",
    "author": "u/Anxious_Hearing9607",
    "timestamp": "2025-07-17T15:13:53.326Z",
    "flair": null,
    "post_text": "What are some budget-friendly security cameras that i can place around the perimeter of my home? I’m 18F and I live with my mom, her boyfriend, oldest brother, his gf and 4 of his kids. We do live on a budget and just this morning someone broke into both of our storage buildings next to our single-wide trailer and camper, and poured gasoline on my brother’s reptiles while it was me and my nephew home alone. This is not the first time someone has attempted to break into our storage buildings.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "UNV NVR having issues with cameras extended via network",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m26cbn/unv_nvr_having_issues_with_cameras_extended_via/",
    "author": "u/LightGuy48",
    "timestamp": "2025-07-17T12:34:13.009Z",
    "flair": null,
    "post_text": "I'm working on a UNV NVR system with 100% UNV cameras, no third party hardware. The NVR is a 302-16E-P16-B. Due to the facility layout having multiple buildings we have four cameras in another building and those four cameras are connected via fiber back to the NVR and plugged into switchport 16 on the rear 16 port PoE switch of the NVR. However, for some reason the NVR does not seem to 'like' a 2nd switch where multiple cameras are residing on one interface, I've seen this before at another site too where multiple cameras shared one interface. Sometimes one or two cameras will disappear and then reappear, sometimes they all disappear. The connection is via two Cisco switches on a GB fiber connection via Cisco SFP's. Cisco switches show no port errors, no connection drops, nothing abnormal on the line between the buildings.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Need advice for buying a security camera for my apartment",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m20dw8/need_advice_for_buying_a_security_camera_for_my/",
    "author": "u/andreas_kieling",
    "timestamp": "2025-07-17T06:37:23.307Z",
    "flair": null,
    "post_text": "hello, I want to buy a security cam for my apartment so I can check on my senior dog while I'm at work. But I'm worried that it might not be safe, I've heard these cheap cams sometimes end up on the internet for everyone to see :') Is there a way to make cheap cams safer? Are my concerns even substantiated? Are there specific brands to avoid? Thank you so much for your advice!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Is this setup worth it",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m1tq5m/is_this_setup_worth_it/",
    "author": "u/SAFETYfirsst",
    "timestamp": "2025-07-17T00:47:04.069Z",
    "flair": null,
    "post_text": "Very new to Security Cameras, and need a setup similar to this for my business. My question is, will this work off grid (More than 1000ft away from a currently established wifi connection. Also, is this way overpriced, and if so, how much would I save building this by myself. https://preview.redd.it/is-this-setup-worth-it-v0-fymc3gl90cdf1.pnghttps://preview.redd.it/is-this-setup-worth-it-v0-3wntwi1a0cdf1.png",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Swann Security camera not recording",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m1cl2i/swann_security_camera_not_recording/",
    "author": "u/Sunor-",
    "timestamp": "2025-07-16T13:27:35.887Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "tight budget, camera system that uses google one storage",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m13v0w/tight_budget_camera_system_that_uses_google_one/",
    "author": "u/nexgenasian",
    "timestamp": "2025-07-16T04:58:08.590Z",
    "flair": null,
    "post_text": "Is there a security camera that lets you set up google one as the storage? I'd like to store data to the cloud whenever there's motion or sound and get alerts. I'm on a budget of about $100 a camera and would like to only pay for the google one subscription. Preferably it would also only use so much of the google one drive and delete older files say after 10 GBs. Thanks for the help in advance!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "DW Spectrum cloud issues",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m10qwq/dw_spectrum_cloud_issues/",
    "author": "u/hamel2021",
    "timestamp": "2025-07-16T02:14:12.065Z",
    "flair": null,
    "post_text": "Is anyone using DW Spectrum and having issues with the cloud accounts getting timed out weekly? I have multiple sites that have clients logged in with a cloud account for remote view of their systems and in the past few months I have been having them get timed out every week even though on those servers the settings are set to not limit session duration. When this happens my phone and laptop will have issues getting back into the cloud account as well. I have raised multiple support tickets and have gotten nowhere with support. The last one was to update to the latest version which has been done on all the sites but then again tonight it timed out again. It also seems to be hit and miss on whether I can just sign them right back in or I have to wait for an hour or so like tonight. The only thing i have noticed is that systems that are on V5 still do not appear to have this issue. Just V6..",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Camera for catching fly tippers",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m0oecx/camera_for_catching_fly_tippers/",
    "author": "u/lonelydaduk",
    "timestamp": "2025-07-15T17:42:02.520Z",
    "flair": null,
    "post_text": "I need a camera that’s covert, battery powered and can see number plates at night. At home I have a unifi system but this location up the road from my house is used by fly tippers weekly. Driving to work and seeing fridges, mattresses and the contents of some unscrupulous house clearing is depressing me so I need to take some vigilante action and capture them. I’ve done some base research but I think most night cameras reflect number plates (i know my unifi cameras do) so looking for recommendations.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "First time security camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m0ldrm/first_time_security_camera/",
    "author": "u/Copingphonix79",
    "timestamp": "2025-07-15T15:50:30.412Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "YI Home can't view clips anymore unless you have cloud... time to sent camera to the trash",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m0it46/yi_home_cant_view_clips_anymore_unless_you_have/",
    "author": "u/elyuma",
    "timestamp": "2025-07-15T14:11:24.435Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Camera for license plates/stalker",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m0hwfp/camera_for_license_platesstalker/",
    "author": "u/Organic-Distance",
    "timestamp": "2025-07-15T13:33:24.739Z",
    "flair": null,
    "post_text": "Hi! I have an issue with a person surveilling my house. She never enters the property but does drive by and stop on the street to \"look\". Lawyers advised to see if I can record her and we can show a pattern of obsession. (Not looking far advise on how to deal with her) Anyhow, I do have a home security system (eufy) but the house is further back from the street and the cams wouldn't capture anything. I also live on a street with frequent traffic. So what I'm looking for is a solution that only records the stalkers car, even at night, and doesn't need wifi as the signal might not always reach to the street. I'm also not a super technical person, easy out of the box setup would be great!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "I need help my car was burned in my back yard can somone identify this camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m06t47/i_need_help_my_car_was_burned_in_my_back_yard_can/",
    "author": "u/pl3ase_help",
    "timestamp": "2025-07-15T03:06:02.691Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Tech advice - non wifi camera solutions",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m06qql/tech_advice_non_wifi_camera_solutions/",
    "author": "u/Alternative_lane",
    "timestamp": "2025-07-15T03:02:42.012Z",
    "flair": null,
    "post_text": "Hello lovely reddits ! So I am in need of advice, I am looking for security cameras that record to a USB or memory card. I don't have Internet other than my phone. I do not require it to be in real time alert. I have problems with my landlord entering the property unannounced, and am concerned it's happening when I'm not at home. Illegal and creepy. I'd like to catch em in the act, so what set up do I need? It's short term, and I can't drill holes and stuff. Some sort of rechargeable nanny cam? One for the front porch, and one for the lounge room area. Cheers!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Solar wifi for cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m03w7x/solar_wifi_for_cameras/",
    "author": "u/Unlikely_Wombat10",
    "timestamp": "2025-07-15T00:48:46.616Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "How to view VicoHome camera's past alerts? Using the app is best?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1m00jn1/how_to_view_vicohome_cameras_past_alerts_using/",
    "author": "u/MsChiSox",
    "timestamp": "2025-07-14T22:23:46.460Z",
    "flair": null,
    "post_text": "Hi, After the notification on my phone from the app has been closed (for a motion alert for example) - how do I find those recording clips? Thank you so much, this is new to me, VicoHome. Edited to add - if the alerts are older than a couple of days and I have the free plan - if I subscribe now to the extended plan in the cloud - will it retroactively make those prior ones viewable? Or, just more going forward? Thanks!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lzvrjr/camera/",
    "author": "u/Latter_Wolverine_627",
    "timestamp": "2025-07-14T19:20:32.247Z",
    "flair": null,
    "post_text": "Does anyone have any advice so I want to put up a camera at my sons grave we know who’s doing the damaging and that, police won’t do anything unless they have it on video the graveyard is a 5 minute walk from me so I don’t have access to wifi or Bluetooth, does anyone have any suggestions on cameras that will work don’t want to go wasting money that’s doesn’t work if there is a camera that would work TIA.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Side Mount PTZ - Oriented to Side (not Down)",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lztqzd/side_mount_ptz_oriented_to_side_not_down/",
    "author": "u/Sycamorepod",
    "timestamp": "2025-07-14T18:06:47.306Z",
    "flair": null,
    "post_text": "Is anyone aware of a side-mount/wall-mount PTZ where the the orientation is to the side, rather than down. It would resemble a dome or turret mounted to wall, but be motorized to pan at 180 degrees and tilt at least 90.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Whole House Recommendations",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lyyfga/whole_house_recommendations/",
    "author": "u/Actual-Stand-4757",
    "timestamp": "2025-07-13T17:24:55.317Z",
    "flair": null,
    "post_text": "Hey all! New to the wireless security world and could use some help. Also, I’m not specifically worried about local storage or subscriptions. I’m am look a quality brand of camera for a wired doorbell, internal camera, and external camera. I have had a Ring doorbell in the past and enjoyed it and the app, but never had anything else Ring. I currently have a Blink doorbell and few camera, but despise the app and the reaction time for motion. Thanks!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Camera no audio or pan and tilt",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lyxo4o/camera_no_audio_or_pan_and_tilt/",
    "author": "u/bluemoon1333",
    "timestamp": "2025-07-13T16:54:19.664Z",
    "flair": null,
    "post_text": "I live in a apartment and the rules are I can have a security camera inside my apartment but it can't have the ability to record audio and it can't be able to pan and tilt. Is there any simple wifi camera that has this ideally I'd be able to connect it to my Synology nas or the cloud so if I am robbed the footage is safe?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Security camera with a long battery life",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ly9tvp/security_camera_with_a_long_battery_life/",
    "author": "u/Similar-Surround8113",
    "timestamp": "2025-07-12T20:09:53.479Z",
    "flair": null,
    "post_text": "I'm looking for a camera with a battery life that lasts months or a wired one that is inconspicuous. I'm trying to place it on a cluttered vanity with the only outlet being behind the vanity. I also need it to stream to my phone and notify me when there's a person in the room like a ring doorbell but without the obnoxious noises. i really need it to be not noticeable.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "PoE connection not working but tester shows the cable is OK",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ly7llv/poe_connection_not_working_but_tester_shows_the/",
    "author": "u/ezeaizen",
    "timestamp": "2025-07-12T18:33:59.841Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "What can I get for a single security camera that records 24/7 without a DVR setup?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ly62g7/what_can_i_get_for_a_single_security_camera_that/",
    "author": "u/Ramblewolf",
    "timestamp": "2025-07-12T17:30:17.108Z",
    "flair": null,
    "post_text": "I'm trying to get a security camera setup for my room, Since I live with a questionable drug addict who I don't trust at all. I also lock my door, But have 1 day a week that I'm not able to do that, and want to make sure my stuff isnt stolen or tampered with. I've tried looking for different type of CCTV type cameras, But almost all the ones I've seen require a whole DVR setup. I just want 1 single camera that can constantly record, and save to an SD card or something similar, and to have the ability to set up my camera to wifi and check on it from my phone, or go back and watch the recording. Any recommendations?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Is this a good install",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ly2hke/is_this_a_good_install/",
    "author": "u/Ok-Blacksmith-7021",
    "timestamp": "2025-07-12T14:58:58.163Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Searching for a CCTV camera that offers clear audio to monitor the cashier in a noisy reception area.",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lxyx22/searching_for_a_cctv_camera_that_offers_clear/",
    "author": "u/Familiar_Tension_638",
    "timestamp": "2025-07-12T12:10:21.848Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Looking for a security camera that can run off a power bank",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lxvi19/looking_for_a_security_camera_that_can_run_off_a/",
    "author": "u/WhatThisGirlSaid",
    "timestamp": "2025-07-12T08:30:44.224Z",
    "flair": null,
    "post_text": "I have a romoss sense 8p 30,000mah that I run some closet motion sensor lights for the front door and wondering if there is a cheap security camera I can attach to that just for simple motion detection people detection purely for delivery notification nothing else.. No other features needed besides maybe night detection No recording or two way talk or any other fancy features required Just looking for the cheapest camera with no subscription fee required to notify me when someone opens my door to leave food inside the front door on my phone and desktop pc There is no nearby mains power to the door unless I run an obstructive extension cable that's why trying to find a camera that can already use an existing power bank there",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Discreet visual and audio camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lxlesm/discreet_visual_and_audio_camera/",
    "author": "u/lucybashh",
    "timestamp": "2025-07-11T23:16:15.086Z",
    "flair": null,
    "post_text": "Hi everyone, Can anyone please recommend a small spy camera that I can put anywhere in my front room that looks like an ornament, something no one wouldn’t notice at all if they looked twice at it? One preferably that would only start recording if there was movement / sound and is a USB to wall plug chargeable that comes with an app i can downloaded to an app on my phone to save videos? Thank you x",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Need long distance NV security camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwxz7y/need_long_distance_nv_security_camera/",
    "author": "u/goober2199",
    "timestamp": "2025-07-11T04:43:01.066Z",
    "flair": null,
    "post_text": "Hello. Im looking for a security camera to watch over my garden. I want it to have good night vision because that is when it's most vulnerable. I would need 100+ feet clear Night vision. Wifi, good battery / solar. I've been researching and looking online but im getting overwhelmed with all the options. Any insight is appreciated, thank you",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Solar & Cellular Outdoor Cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwwaco/solar_cellular_outdoor_cameras/",
    "author": "u/Relevant_Act2046",
    "timestamp": "2025-07-11T03:12:58.069Z",
    "flair": null,
    "post_text": "I’m looking for an outdoor surveillance camera that would be good for a remote setting. No wifi is available on this site and neither is electricity so I think a solar/cellular camera may be the best fit for this kind of application. Please advise if you have another suggestion. I know of Reolink and have installed a couple previously but their PIR motion detection isn’t the best and their night vision is worse. What other brands or models of cameras would you recommend for this kind of application? Requirements: Reasonably priced Solar powered Cellular based Decent night vision and motion detection.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Can anyone identify this security camera?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwuxxm/can_anyone_identify_this_security_camera/",
    "author": "u/Aviorwolf",
    "timestamp": "2025-07-11T02:06:44.700Z",
    "flair": null,
    "post_text": "My neighbor put this up pointing at my backyard. Sorry for the poor photo quality! https://preview.redd.it/can-anyone-identify-this-security-camera-v0-2w0joshwk5cf1.jpg",
    "score": null,
    "comments_count": null
  },
  {
    "title": "wifi mini hidden spy camera wireless hd 1080p",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwrmfu/wifi_mini_hidden_spy_camera_wireless_hd_1080p/",
    "author": "u/RepeatPlayful3779",
    "timestamp": "2025-07-10T23:27:47.694Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Lorex security cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwqn3a/lorex_security_cameras/",
    "author": "u/EmeraldFireWolf",
    "timestamp": "2025-07-10T22:45:32.848Z",
    "flair": null,
    "post_text": "So recently I have been having issues with the people my kids find themselves around so I am looking into a security camera system. Thst I can expand upon. I am looking at the lorex brand but want more people's opions on this company and possible alternatives if it turns out that this isnt the right pick for me. Any information would be amazing.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "24/7 Video recording review/“scrubbing”",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwjtvf/247_video_recording_reviewscrubbing/",
    "author": "u/yanksfold",
    "timestamp": "2025-07-10T18:12:01.934Z",
    "flair": null,
    "post_text": "Is there a quality system that has ability to do “scrubbing” for review of video (vs viewing recorded clips)? Nest does it well but I would prefer anything but Google!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Our AirBnb has these throughout the home with privacy shield open - what are they and how to tell if these are live?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwghes/our_airbnb_has_these_throughout_the_home_with/",
    "author": "u/BitcoinRigNoob",
    "timestamp": "2025-07-10T16:01:46.742Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Mobotix jpg url on newer models Mx-VB1A-8-IR-VA",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwf388/mobotix_jpg_url_on_newer_models_mxvb1a8irva/",
    "author": "u/smhick",
    "timestamp": "2025-07-10T15:06:45.331Z",
    "flair": null,
    "post_text": "We recently purchased a new Mx-VB1A-8-IR-VA and we were wondering how we can grab a still jpg image from the camera. On our older Mobotix M15 camera we just used the following URL http://192.168.1.1/record/current.jpg and we see a still image from the camera But testing this on the new Mx-VB1A-8-IR-VA camera doesn't seem to work New camera IP is 192.168.1.2 Tested http://192.168.1.2/record/current.jpg and get the following error Access Error: 404 -- Not Found I'm able to open up the mjpeg live stream no problem via the following URL",
    "score": null,
    "comments_count": null
  },
  {
    "title": "PoE doorbell cameras options",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lwef1q/poe_doorbell_cameras_options/",
    "author": "u/WishboneTemporary232",
    "timestamp": "2025-07-10T14:39:26.577Z",
    "flair": null,
    "post_text": "Looking for a PoE doorbell camera. Are there any other options aside from Reolink? Hoping to use with my Swann NVR.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Simple live camera suggestions?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lw56xs/simple_live_camera_suggestions/",
    "author": "u/KarnifalChimera",
    "timestamp": "2025-07-10T05:57:15.117Z",
    "flair": null,
    "post_text": "Alright, I think this is the right place to ask this? I'm trying to find a basic camera to monitor my barn. I don't need any audio features, absolutely don't want to deal with a subscription, don't really need it to record anything. I just need to be able to look in frequently to check on them without walking out there at all hours, especially when I have girls expecting babies. Night vision would be important but motion detection is not, the animals would set it off every few minutes and that seems silly. It would be technically indoors (the barn is a concrete block building but it does have little screened vents at the top and bottom of two walls) so it won't get wet but it could get cold (just above freezing at the lowest). There is power out there in the form of a regular outlet (I run ac and fans in the summer) so I'd prefer a wired camera. The wifi does just about reach I believe but doing high demand things like video calls in there has had some crunchiness. I imagine that if its just sending video out, no audio, and not receiving anything back it should work? I'd look into cellular but I have a feeling that would be more expensive and I'm on a tighter budget with this.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Altered with security cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lw2uis/altered_with_security_cameras/",
    "author": "u/chronosthetitan",
    "timestamp": "2025-07-10T03:41:33.905Z",
    "flair": null,
    "post_text": "I’ll be on my app and hear from the cameras but if you save the footage there’s no sound. Sometimes the cameras go out. Am I being WiFi jammed?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Best Way to Share Tapo C402 Camera Access with Immediate Family",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvxjy9/best_way_to_share_tapo_c402_camera_access_with/",
    "author": "u/bbgarnett",
    "timestamp": "2025-07-09T23:21:52.930Z",
    "flair": null,
    "post_text": "I just ordered two TP-Link Tapo SolarCam C402 Kits and they’ll be arriving next week. Will be using them strictly with a Micro SD card and no cloud storage. We're planning to install them at our family cabin so everyone can keep an eye on the place when we’re not there—mainly to monitor the garden, lake area, and any animals that might be getting into things. I was wondering if there’s any way to set the cameras up so I can give people a link to view the feed, without requiring everyone to download the Tapo app. Ideally, I’d like it to be “public” in the sense that it's easily accessible (like via a URL), but still —not just anyone with the link. If that’s not possible, is there at least a way for multiple people to have their own Tapo accounts and log in to view the cameras and or get notifications? Just looking for the simplest way to share access with family without making it a hassle. Thanks!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Continuous Live Stream Help",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvt7xy/continuous_live_stream_help/",
    "author": "u/InsignificantUnit137",
    "timestamp": "2025-07-09T20:21:26.991Z",
    "flair": null,
    "post_text": "Hi everyone! I need some help. I work at a mall and we recently got a rooftop beehive. My boss wants a continuous live stream of the beehive to stream to a TV on the mall floor. The problem is that we don’t have a computer to run the stream so we need the feed to go from the camera straight to the TV somehow. We can buy a smart TV and weatherproof camera but are at a loss on what to get and how to actually set it up. None of us are very tech savvy, we just want a way to watch our bees! Any help is very appreciated!!! Thank you!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Blink outdoor 3/4 the right option?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvr9x1/blink_outdoor_34_the_right_option/",
    "author": "u/Jay20W",
    "timestamp": "2025-07-09T19:04:44.081Z",
    "flair": null,
    "post_text": "A friend of mine would like to put in some outdoor security at her barn. She’s looking to put in about 6 cameras total, all outside covering the exterior and pathways to her barn (she boards and trains horses) I was thinking she might like the Blink outdoor cameras because they are relatively simple, WiFi, enabled, motion activated and have IR for night time. My only concern is battery life. Trying to keep the overall bill under $500 and open to recommendations",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Non-subscription, closed network options?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvq24i/nonsubscription_closed_network_options/",
    "author": "u/WARowland",
    "timestamp": "2025-07-09T18:17:26.916Z",
    "flair": null,
    "post_text": "Looking for a home system with wireless cameras, but that I can set up without an internet connection? Just not sure if there's anything out there like it. Basically, is there a system that let's me connect the cameras to a non-internet wifi network (basically a router with no-modem) and transfer footage to an offline central storage hub that way (like an computer or harddrive also on the network) Would a normal wifi-camera set up allow me to do that? Sorry if the question doesn't quite make sense. Im just not familiar enough with the industry to know what terminology to even look for. I've been hesitant to look at home secuirty systems because I don't like the idea of someone potentially being able to get into my home Internet wifi, and access the system from the internet (yes, I'm paranoid).",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Wireless/Solar + 4G/LTE Outdoor Security Cameras for 5-Building Industrial Park – Recommendations?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lvmgnx/wirelesssolar_4glte_outdoor_security_cameras_for/",
    "author": "u/Hungry_Coconut930",
    "timestamp": "2025-07-09T15:57:42.481Z",
    "flair": null,
    "post_text": "We’ve looked at Reolink Go/Go PT Plus, Arlo Go 2, and Eufy 4G Cam S330, but real-world feedback would help. Budget is flexible for reliability. What works well for you? We would need roughly 4-6 cameras. Thanks in advance!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Camera detected motion at night and I’m paranoid af",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lva66i/camera_detected_motion_at_night_and_im_paranoid_af/",
    "author": "u/Scared_Ad_8772",
    "timestamp": "2025-07-09T04:54:08.119Z",
    "flair": null,
    "post_text": "Long story short I had a pet camera (cheap from Amazon) downstairs for my foster dog. Now it’s my first night without my foster dog and I didn’t unplug the camera downstairs because I didn’t think of it. Right before I go to sleep I check my notifications and it says motion detected and I immediately start shaking while trying to open the app. Then the app just doesn’t work!🥲 it won’t show me the live feed just keeps buffering on a frozen image of downstairs. Granted it does say expired but I didn’t think I had to have a plan. It’s boykeep from Amazon super cheap it’s also sitting on the floor so if someone could tell me it was most likely a bug that would be appreciated because I’m paralyzed with fear locked in my room for the last hour when I should be sleeping. I locked all doors like always and keep my porch light on. I hate being alone, I miss my foster. Someone please tell me I’m overreacting and to go to sleep. Thanks.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Recommendations",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv673r/recommendations/",
    "author": "u/rvallo22",
    "timestamp": "2025-07-09T01:25:52.405Z",
    "flair": null,
    "post_text": "Looking for recs on security cameras. Currently new build, roughly 6,000 sq ft finished on 3.5 acres. Looking for recs on cameras. Planning on doing an Orbi 970 mesh network for wifi, electrician will run CAT 6 for cameras. Ideally would like local storage without monthly fee. Have looked at several, confused regarding PoE switch necessary? Thanks!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Parked car wireless security camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv552o/parked_car_wireless_security_camera/",
    "author": "u/Exotic_Dig2773",
    "timestamp": "2025-07-09T00:34:25.484Z",
    "flair": null,
    "post_text": "My daughter’s car has gotten keyed a couple times. First time was able to buff out second time had the doors repainted. We are pretty sure we know who is doing this, but need some proof. I’m wondering if there are some decent inexpensive wireless cameras that could do this. At this point, I’m a bit overwhelmed trying to find what I’m looking for. She doesn’t need a dash cam system just looking for some thing that is wireless and can record at night when it’s parked, hopefully that has motion detection so it doesn’t wear out the battery life. I could also buy a battery pack or another source of power as well. Her cigarette lighter does not work when her car is turned off.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Business cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv4h4x/business_cameras/",
    "author": "u/Ok_Worldliness4413",
    "timestamp": "2025-07-09T00:03:04.960Z",
    "flair": null,
    "post_text": "Does anyone know of a camera system that will allow multiple people to view at the same while not having control? I’m planning on providing my boarders/clients access to view their horses on camera while in their turnout. But I don’t particularly want my clients watching me after hours fixing a fence or scooping poo in my sports bra etc. so the ability to turn off their access is a must. Also the ability to completely take away their access all together if they leave and move their horse to a different property.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Best Budget Battery Security Cams for Prime Day? (No Wiring Needed)",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv1x30/best_budget_battery_security_cams_for_prime_day/",
    "author": "u/No-Structure828",
    "timestamp": "2025-07-08T22:09:59.273Z",
    "flair": null,
    "post_text": "Hey all, Just moved into a new place and I’m looking for 2–3 budget-friendly, battery-powered security cameras ideally from a decent brand. I really don’t want to mess with wiring, so wireless/battery is a must for me. My main goal is to cover the cars and the back door, which faces a busy estate walkway (looooots of kids and dog walkers). Since it’s Prime Day, I’d like to snag a deal if possible. I’m currently eyeing the TP-Link Tapo TC82 and TC85 (2K battery cams), they seem decent for the price. I used Reolink before (wired, though), and was thinking maybe add the TD21 Tapo video doorbell as well. Also noticed some Eufy cams on sale.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "New Camera system upgrade for business",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv1ekl/new_camera_system_upgrade_for_business/",
    "author": "u/Sinnawinna",
    "timestamp": "2025-07-08T21:48:55.360Z",
    "flair": null,
    "post_text": "Hello I am looking to upgrade my current camera system at my business which is a grocery store. I currently have a 16 channel and want atleast a 20 channel that has high-definition video w/ audio that can get good facial recognition and be able to read a license plate for the outside cameras. Price it not a problem but would like it to have easy installation and a good app feature that I can easily use to check footage in a hurry. Thanks in advance!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "POE not showing image",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv0mok/poe_not_showing_image/",
    "author": "u/userforred",
    "timestamp": "2025-07-08T21:17:02.349Z",
    "flair": null,
    "post_text": "Hello peeps, wondering if anyone could help So I have swann poe, 8 channel 6 camera working, had long cables so decided to shorten them, (did this before and no issues) I have an outdoor 60 foot cable that worked fine but after the shorten I get no image but power. I checked my cable with tester and 100% working. I tried bran new camera on 60 foot cable and nothing. I tried different ports and nothing. Tried different power slot on power square and nothing. I tried a 10 foot cable on the new camera and works. Shows it's getting power in the software. Rebooted, waiting 10 minutes and nothing.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Suggestions for camera to be used as a \"Traffic Cam\" or \"Weather Cam\"",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lv0adl/suggestions_for_camera_to_be_used_as_a_traffic/",
    "author": "u/GradyCole",
    "timestamp": "2025-07-08T21:03:33.209Z",
    "flair": null,
    "post_text": "I'm not having much luck searching on my own, so I thought I'd ask the experts here... I'm looking for an outdoor camera to watch over some pickleball courts and broadcast the feed for the general public to check a live view of the courts. It won't function as a security camera that needs playback, or object detection, just something that allows me to stream live video to a WordPress site (embedded YouTube video...?). It won't be hooked up to a computer, so the feed would need to be made available from the camera itself. We have WiFi, and could probably do PoE, though it would require some drilling of holes.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Replacing Lorex WiFi cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1luyvnv/replacing_lorex_wifi_cameras/",
    "author": "u/Bitter-Air-8760",
    "timestamp": "2025-07-08T20:08:30.781Z",
    "flair": null,
    "post_text": "We have had these cameras for about three years and they're just a hassle now, either needing to be recharged constantly or false notifications of someone at the door. I live in Canada, so it's cold in the winter. My Lorex cameras are located under a covered porch, so the cameras with the solar panel won't work. I'm looking for 2-3 cameras that can handle the cold, preferably WiFi but could go to plug in if needed, and don't required a paid cloud storage account. Appreciate any help.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "No Drill Anti-Theft Mount for AOSU Video Doorbell Ultra",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1luwf9w/no_drill_antitheft_mount_for_aosu_video_doorbell/",
    "author": "u/Serious-Today",
    "timestamp": "2025-07-08T18:33:34.825Z",
    "flair": null,
    "post_text": "I bought this AOSU doorbell camera but cannot find a no drill anti-theft mount that fits it. Has anyone found one that works? The mounts I am finding fit a camera of a max size of 5.1 inches, and this camera is 5.5 inches.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Smarts needed just why not.",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1luu0he/smarts_needed_just_why_not/",
    "author": "u/FalselyStorm",
    "timestamp": "2025-07-08T17:02:47.678Z",
    "flair": null,
    "post_text": "would anyone with exstensive knowledge of cct and videos explain why the epstein footage would skip a min and if anything seems odd, any details on your take just interested in an internet video specialist. the aspect ratio shift seems uneeded for any reason.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Rate this setup",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lurj7n/rate_this_setup/",
    "author": "u/flush101",
    "timestamp": "2025-07-08T15:27:19.747Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Looking for an outdoor wired camera with a longer post detection recording length, can anyone advise on a product?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lujm4z/looking_for_an_outdoor_wired_camera_with_a_longer/",
    "author": "u/tveegee777",
    "timestamp": "2025-07-08T08:51:46.274Z",
    "flair": null,
    "post_text": "Hey ya'll just curious if anyone has any experience with a wired security camera with the feature to constantly record to a cloud storage - so long as motion is detected. I have a few storage locations for my business and it'll need to be wired to a power outlet while being able to record to the cloud via wifi. I've only been able to find one camera but it'll only record for 60 seconds post motion detection. any help would be appreciated!",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Old and New DVRs / NVRs and Security Cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lujl2o/old_and_new_dvrs_nvrs_and_security_cameras/",
    "author": "u/Commercial_Tap_7541",
    "timestamp": "2025-07-08T08:49:45.785Z",
    "flair": null,
    "post_text": "I have Reolink devices mainly in a new home and there are legacy cameras that are also installed by the previous owners. The legacy system is a DVR Model UTC-EDVR-8 see picture UTC-EDVR-8 This has 5 Cameras connected which work OK\nIt is very difficult to run new cables to new cameras to replace the old cameras so what I am attempting to do is integrate old cameras into the new system The Reolink NVR is a RLN8-410 which I bought refurbished on EBay I tried some converters for RJ45 which just do not work in the Reolink NVR with the old cameras",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Reccomedations for UK yard camera prime day sale",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1luif5e/reccomedations_for_uk_yard_camera_prime_day_sale/",
    "author": "u/Wiedegeburt",
    "timestamp": "2025-07-08T07:30:02.580Z",
    "flair": null,
    "post_text": "Hi folks ! Just wondering if anyone has any recs for a camera for a small terraced house yard in the ghetto, neighbour was recently broken into and robbed. Maybe a floodlight one? (Unless this isn't a good idea or it is to restrictive to select one) Solar or battery would be great but I can install wired if need be. I already have a ring doorbell at the front and Alexa speakers so could get ring as it's all heavily discounted for a couple of days but would look at other options if they are better ! Cheers 🙂",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Questions in regards to LTE Solar Cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lubzub/questions_in_regards_to_lte_solar_cameras/",
    "author": "u/Abject-Plankton6256",
    "timestamp": "2025-07-08T01:27:44.742Z",
    "flair": null,
    "post_text": "Background:\nHave a vacant house that has some damage done to electric wiring\nProperty has no power and no Internet\nWill likely be renovating soon (idk if they will need to cut the power off for long periods of time)\nBroken into once since it became vacant 10 months ago",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Rec for cameras, no sub, store locally - no microSD etc",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lu6uu7/rec_for_cameras_no_sub_store_locally_no_microsd/",
    "author": "u/Patient_Mousse_2465",
    "timestamp": "2025-07-07T21:38:18.779Z",
    "flair": null,
    "post_text": "Hi all. First time posting here. Hubs and I are looking for a rec of cameras that can store locally to a NAS or DVR, prefer wireless (but wired OK), that we DON'T need to pay a monthly subscription for. We'd likely only need 4 cameras, or 3 + 1 ring camera. The idea is to put 1 in our chicken coop, 1 on the garage, 1 at the front door (possible doorbell cam?) and potentially 1 inside facing front door & living area. Bonus points if there is an app for live connection as well.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "VicoHome Bird Cam: How To Livestream directly to Youtube channel",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lu4lle/vicohome_bird_cam_how_to_livestream_directly_to/",
    "author": "u/hijunglegym",
    "timestamp": "2025-07-07T20:10:30.823Z",
    "flair": null,
    "post_text": "Just got a ViceHome Smart Bird Camera and trying to figure out how to automate it to set up to a Youtube channel for sharing birdwatching in the yard. Anyone know?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Is this a hidden camera?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lu0qkz/is_this_a_hidden_camera/",
    "author": "u/KCB503",
    "timestamp": "2025-07-07T17:43:34.328Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Reolink NVR with Geovision IP cameras",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ltz2qd/reolink_nvr_with_geovision_ip_cameras/",
    "author": "u/Adrixe",
    "timestamp": "2025-07-07T16:41:39.253Z",
    "flair": null,
    "post_text": "Hi Guys, we currently bought a new house with existing POE security cameras that are Geovision. It was connected to a switch but Im not sure how to access it. Im thinking of purchasing a reolink NVR so that I can access the cameras remotely. Is it possible? The geovision NVR are more expensive and looks like I need to subscribe for me to be able to access remotely? Need some guidance before purchasing a new NVR. The reolink seems to be fairly decently priced compared to the geovision ones.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Licensed 1 Yi camera to stop the span ads on app opening. Now cant add a new camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ltuwq6/licensed_1_yi_camera_to_stop_the_span_ads_on_app/",
    "author": "u/PCWeber",
    "timestamp": "2025-07-07T13:59:52.935Z",
    "flair": null,
    "post_text": "I have 8 total Yi cameras and they all work. 1 licensed so as to stop to spam adds when you open the app. Am I now limited to the licensed camera count of 1 so not able to add any new cameras?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "HELP!",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ltsk0t/help/",
    "author": "u/WarAlarmed6897",
    "timestamp": "2025-07-07T12:13:19.065Z",
    "flair": null,
    "post_text": "Hey I’m a $tuD3nt.And are there any ways to block or how can i prevent the principal watching my classroom from cctv?.Im thinking about jamming and is it even possible?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "EseeCloud",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ltshpi/eseecloud/",
    "author": "u/Witty_Cap1280",
    "timestamp": "2025-07-07T12:09:57.784Z",
    "flair": null,
    "post_text": "Is it necessary to have an sd card for this security camera?",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Please help me find the best outdoor camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1ltezvv/please_help_me_find_the_best_outdoor_camera/",
    "author": "u/czt_1563",
    "timestamp": "2025-07-06T23:15:36.897Z",
    "flair": null,
    "post_text": "Hello, I have recently had some property damage to my front door from kids. While banging on the front door they broke the frame to my storm door and pushed the glass out. This is an ongoing issue that’s why I decided it’s time to set up cameras. I currently have no cameras at all. What I’m looking for is something relatively budget friendly (under 100 dollars maybe?) and easy to use camera. I am not tech savvy at all and would like it to be a simple set up. I’m looking for a camera that is wireless, has a motion activated light, and has night vision. I’m ok paying a small fee for a subscription if that means I can always watch it from my phone and play back video footage. For example… after they “ding dong ditch” and cause damage, I could see who did it.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Security Camera Suggestion - In door camera",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lte1tw/security_camera_suggestion_in_door_camera/",
    "author": "u/Purple_Ad1383",
    "timestamp": "2025-07-06T22:32:16.186Z",
    "flair": null,
    "post_text": "Hello everyone, Sorry in advance if this is not the right place for this question. I am looking for some suggestions for an in door camera and i have just been a little overwhelmed with choice. My family are wanting some cameras in my grandmothers house so we can keep and eye on her, shes losing her sight and is very stubborn and refuses to move to an assisted living home and we want to know if she falls down so we can help her. I am looking for a camera that can do the following. - Wifi enabled so we can connect to it remotely. - Battery powered, We dont want to run new wires to power it.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Ring alternative",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lt382l/ring_alternative/",
    "author": "u/GeneralTransition215",
    "timestamp": "2025-07-06T14:57:21.543Z",
    "flair": null,
    "post_text": "I have been using video doorbells and security cameras for over 5 years now. I started off with Ring then moved to Arlo setup with paid subscription. Arlo 4k cameras with solar panels are just awesome but the doorbell had a lag So then I shifted back to the Ring ecosetup, paid monthly, with security base, motion sensors and door sensors. Overall it’s decent - Ring solar outdoor camera works in 2k, have never charged it in summer but UK winters require monthly charging. Their new doorbells have no lag. Monthly subscription is a bit expensive. But the cameras have never failed me.",
    "score": null,
    "comments_count": null
  },
  {
    "title": "Night vision blurry",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lsrhhb/night_vision_blurry/",
    "author": "u/Ok_Money8121",
    "timestamp": "2025-07-06T03:24:18.971Z",
    "flair": null,
    "post_text": null,
    "score": null,
    "comments_count": null
  },
  {
    "title": "Is there still a way to setup a new Samsung Smartcam?",
    "url": "https://www.reddit.comhttps://www.reddit.com/r/SecurityCamera/comments/1lsn1z1/is_there_still_a_way_to_setup_a_new_samsung/",
    "author": "u/tablepennywad",
    "timestamp": "2025-07-05T23:24:50.330Z",
    "flair": null,
    "post_text": "I was given a new in package samsung smartcam but found that it is no longer supported. Is there still a way to set it up to use with RTSP?",
    "score": null,
    "comments_count": null
  }
]