[
  {
    "id": "1m2rv3p",
    "title": "Recomendation for DVR using Trackmix wifi.",
    "author": "u_siciliano",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2rv3p/recomendation_for_dvr_using_trackmix_wifi/",
    "score": 2,
    "num_comments": 0,
    "created_utc": "2025-07-18T03:32:49Z",
    "flair": null,
    "post_text": null
  },
  {
    "id": "1m2rqlt",
    "title": "LTS camera adjustment",
    "author": "BloodyNightwalker",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2rqlt/lts_camera_adjustment/",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-07-18T03:26:18Z",
    "flair": null,
    "post_text": "Hello everybody quick question. I’m the building maintenance for our building and I need to slightly adjust these LTS cameras and I cannot for the life of me figure out how to adjust them. They are very tight. I am not the one that installed them, but they need to be adjusted Any assistance is greatly appreciated"
  },
  {
    "id": "1m2qp35",
    "title": "Aosu cameras connecting to monitor.",
    "author": "Mike-huntts",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2qp35/aosu_cameras_connecting_to_monitor/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-18T02:33:49Z",
    "flair": null,
    "post_text": "Anyone have any idea how I can connect my aosu cameras to a computer monitor? Want to have it continuously running beside my tv with the cameras up. "
  },
  {
    "id": "1m2nz8s",
    "title": "Ring Camera hacked?!",
    "author": "Ok_Accountant_4954",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2nz8s/ring_camera_hacked/",
    "score": 2,
    "num_comments": 0,
    "created_utc": "2025-07-18T00:23:39Z",
    "flair": null,
    "post_text": null
  },
  {
    "id": "1m2lkgu",
    "title": "Whats wrong",
    "author": "cashma352",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2lkgu/whats_wrong/",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-07-17T22:36:10Z",
    "flair": null,
    "post_text": "Why are my cameras doing this"
  },
  {
    "id": "1m2emco",
    "title": "Hiseeu",
    "author": "jnctx2020",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2emco/hiseeu/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-17T18:02:47Z",
    "flair": null,
    "post_text": "Hello we just purchased a hiseeu system for our business and the led lights we have a affecting the cameras so that black lines are running through the screen. Anyone know what I can do to fix this or a similar system that will work. Our older revo system works fine with the lights but it's from 2008 and needs replacing. Any help would be great thank you "
  },
  {
    "id": "1m2dp4v",
    "title": "Looking for wireless, solar, no subscription security camera",
    "author": "Spetz",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2dp4v/looking_for_wireless_solar_no_subscription/",
    "score": 3,
    "num_comments": 31,
    "created_utc": "2025-07-17T17:27:55Z",
    "flair": null,
    "post_text": "I’m looking for a wireless security camera for the side of my house. The plan is to have the camera sit behind a motion activated security light from Sansi as a deterrent.\n\nCriteria:\n\n* No monthly subscription – critical\n* Application or browser controlled, but the application must not have subscription fee based options, because this means that the default option without subscription is not good enough.\n* Solar powered\n* Wifi\n* Local storage with continuous recording in loop capability\n* No budget limit, but I do not want to run wires through my house.\n\nThanks for the advice in advance."
  },
  {
    "id": "1m2d4x8",
    "title": "Help document emotional abuse in Texas",
    "author": "mugskitten",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2d4x8/help_document_emotional_abuse_in_texas/",
    "score": 3,
    "num_comments": 8,
    "created_utc": "2025-07-17T17:06:35Z",
    "flair": null,
    "post_text": "Hi, I am working to try and find a camera that will accurately record situations in my house. My stbx husband is extremely volatile and emotionally abusive, screaming, broken furniture, a broken window, doors, punched holes in walls ect. My current blink cameras are notorious for not activating when motion is sensed right away so a lot is missed. I have filed for divorce, just waiting for him to be served, if it was just me I would just leave, but I have 4 kids, one works locally, and school starts in a few weeks, and we have 2 ferrets, and 8 cats whom he has threatened to kill. So please help me find a c camera solution that I can document this for court. "
  },
  {
    "id": "1m2a6wv",
    "title": "Security Camera Recommendations",
    "author": "Anxious_Hearing9607",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m2a6wv/security_camera_recommendations/",
    "score": 1,
    "num_comments": 6,
    "created_utc": "2025-07-17T15:13:53Z",
    "flair": null,
    "post_text": "What are some budget-friendly security cameras that i can place around the perimeter of my home?\n\nI’m 18F and I live with my mom, her boyfriend, oldest brother, his gf and 4 of his kids. \nWe do live on a budget and just this morning someone broke into both of our storage buildings next to our single-wide trailer and camper, and poured gasoline on my brother’s reptiles while it was me and my nephew home alone.\n\nThis is not the first time someone has attempted to break into our storage buildings."
  },
  {
    "id": "1m26cbn",
    "title": "UNV NVR having issues with cameras extended via network",
    "author": "LightGuy48",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m26cbn/unv_nvr_having_issues_with_cameras_extended_via/",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-07-17T12:34:13Z",
    "flair": null,
    "post_text": "I'm working on a UNV NVR system with 100% UNV cameras, no third party hardware. The NVR is a 302-16E-P16-B.  Due to the facility layout having multiple buildings we have four cameras in another building and those four cameras are connected via fiber back to the NVR and plugged into switchport 16 on the rear 16 port PoE switch of the NVR.\n\nHowever, for some reason the NVR does not seem to 'like' a 2nd switch where multiple cameras are residing on one interface,  I've seen this before at another site too where multiple cameras shared one interface.  Sometimes one or two cameras will disappear and then reappear, sometimes they all disappear. The connection is via two Cisco switches on a GB fiber connection via Cisco SFP's.  Cisco switches show no port errors, no connection drops, nothing abnormal on the line between the buildings.\n\nSo is the built in switch on the NVR not a true switch or something unique to the UNV unit where it only wants to see one camera per interface?   Is there a workaround to fix the issue of the cameras disappearing and reappearing?  Thanks!"
  },
  {
    "id": "1m20dw8",
    "title": "Need advice for buying a security camera for my apartment",
    "author": "andreas_kieling",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m20dw8/need_advice_for_buying_a_security_camera_for_my/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-17T06:37:23Z",
    "flair": null,
    "post_text": null
  },
  {
    "id": "1m1tq5m",
    "title": "Is this setup worth it",
    "author": "SAFETYfirsst",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m1tq5m/is_this_setup_worth_it/",
    "score": 2,
    "num_comments": 0,
    "created_utc": "2025-07-17T00:47:04Z",
    "flair": null,
    "post_text": "Very new to Security Cameras, and need a setup similar to this for my business. My question is, will this work off grid (More than 1000ft away from a currently established wifi connection. Also, is this way overpriced, and if so, how much would I save building this by myself.\n\nhttps://preview.redd.it/fymc3gl90cdf1.png?width=2356&amp;format=png&amp;auto=webp&amp;s=60269eeae2dd21664013b46ce4d62f9f9687e4b1\n\nhttps://preview.redd.it/3wntwi1a0cdf1.png?width=850&amp;format=png&amp;auto=webp&amp;s=5fb3b8995f71f543e64652ad2f1efe7f34d88c85\n\n"
  },
  {
    "id": "1m1cl2i",
    "title": "Swann Security camera not recording",
    "author": "Sunor-",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m1cl2i/swann_security_camera_not_recording/",
    "score": 2,
    "num_comments": 7,
    "created_utc": "2025-07-16T13:27:35Z",
    "flair": null,
    "post_text": "Hello just got a new swann security camera set. ive set up 2 cameras 2 days ago yet theyve not been recording anything. theyve got a 256gb micro sd inside aswell however nothing has been captured. i want it to record 24/7 not just motion."
  },
  {
    "id": "1m13v0w",
    "title": "tight budget, camera system that uses google one storage",
    "author": "nexgenasian",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m13v0w/tight_budget_camera_system_that_uses_google_one/",
    "score": 0,
    "num_comments": 8,
    "created_utc": "2025-07-16T04:58:08Z",
    "flair": null,
    "post_text": "Is there a security camera that lets you set up google one as the storage? I'd like to store data to the cloud whenever there's motion or sound and get alerts. I'm on a budget of about $100 a camera and would like to only pay for the google one subscription. Preferably it would also only use so much of the google one drive and delete older files say after 10 GBs.  Thanks for the help in advance!"
  },
  {
    "id": "1m10qwq",
    "title": "DW Spectrum cloud issues",
    "author": "hamel2021",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m10qwq/dw_spectrum_cloud_issues/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-16T02:14:12Z",
    "flair": null,
    "post_text": "Is anyone using DW Spectrum and having issues with the cloud accounts getting timed out weekly?  I have multiple sites that have clients logged in with a cloud account for remote view of their systems and in the past few months I have been having them get timed out every week even though on those servers the settings are set to not limit session duration.  When this happens my phone and laptop will have issues getting back into the cloud account as well.  I have raised multiple support tickets and have gotten nowhere with support.  The last one was to update to the latest version which has been done on all the sites but then again tonight it timed out again.  It also seems to be hit and miss on whether I can just sign them right back in or I have to wait for an hour or so like tonight.  The only thing i have noticed is that systems that are on V5 still do not appear to have this issue.  Just V6..  "
  },
  {
    "id": "1m0oecx",
    "title": "Camera for catching fly tippers",
    "author": "lonelydaduk",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0oecx/camera_for_catching_fly_tippers/",
    "score": 7,
    "num_comments": 36,
    "created_utc": "2025-07-15T17:42:02Z",
    "flair": null,
    "post_text": "I need a camera that’s covert, battery powered and can see number plates at night.\n\nAt home I have a unifi system but this location up the road from my house is used by fly tippers weekly. Driving to work and seeing fridges, mattresses and the contents of some unscrupulous house clearing is depressing me so I need to take some vigilante action and capture them.\n\nI’ve done some base research but I think most night cameras reflect number plates (i know my unifi cameras do) so looking for recommendations.\n\n"
  },
  {
    "id": "1m0ldrm",
    "title": "First time security camera",
    "author": "Copingphonix79",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0ldrm/first_time_security_camera/",
    "score": 8,
    "num_comments": 29,
    "created_utc": "2025-07-15T15:50:30Z",
    "flair": null,
    "post_text": "First time wiring up security cameras in new home what y'all think. Mounted the box under desk. "
  },
  {
    "id": "1m0it46",
    "title": "YI Home can't view clips anymore unless you have cloud... time to sent camera to the trash",
    "author": "elyuma",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0it46/yi_home_cant_view_clips_anymore_unless_you_have/",
    "score": 5,
    "num_comments": 8,
    "created_utc": "2025-07-15T14:11:24Z",
    "flair": null,
    "post_text": null
  },
  {
    "id": "1m0hwfp",
    "title": "Camera for license plates/stalker",
    "author": "Organic-Distance",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m0hwfp/camera_for_license_platesstalker/",
    "score": 1,
    "num_comments": 11,
    "created_utc": "2025-07-15T13:33:24Z",
    "flair": null,
    "post_text": "Hi!\nI have an issue with a person surveilling my house. She never enters the property but does drive by and stop on the street to \"look\". Lawyers advised to see if I can record her and we can show a pattern of obsession. (Not looking far advise on how to deal with her)\nAnyhow, I do have a home security system (eufy) but the house is further back from the street and the cams wouldn't capture anything. I also live on a street with frequent traffic. \nSo what I'm looking for is a solution that only records the stalkers car, even at night, and doesn't need wifi as the signal might not always reach to the street. I'm also not a super technical person, easy out of the box setup would be great!"
  },
  {
    "id": "1m06t47",
    "title": "I need help my car was burned in my back yard can somone identify this camera",
    "author": "pl3ase_help",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m06t47/i_need_help_my_car_was_burned_in_my_back_yard_can/",
    "score": 0,
    "num_comments": 18,
    "created_utc": "2025-07-15T03:06:02Z",
    "flair": null,
    "post_text": " Someone burned my car in my backyard i have no insurance  im screwed... this trailer has a camera   point at my back yard   he said it dont work i think hes lying and is covering for his brother  who i think did it i have some evidence but not enough.  does this have onboard storage ? Or anything? I need help im completely  doomed\n"
  },
  {
    "id": "1m06qql",
    "title": "Tech advice - non wifi camera solutions",
    "author": "Alternative_lane",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m06qql/tech_advice_non_wifi_camera_solutions/",
    "score": 4,
    "num_comments": 5,
    "created_utc": "2025-07-15T03:02:42Z",
    "flair": null,
    "post_text": "Hello lovely reddits !\n\nSo I am in need of advice, I am looking for security cameras that record to a USB or memory card. I don't have Internet other than my phone. I do not require it to be in real time alert.\n\nI have problems with my landlord entering the property unannounced, and am concerned it's happening when I'm not at home. Illegal and creepy.\n\nI'd like to catch em in the act, so what set up do I need? It's short term, and I can't drill holes and stuff. Some sort of rechargeable nanny cam? One for the front porch, and one for the lounge room area.\n\nCheers!"
  },
  {
    "id": "1m03w7x",
    "title": "Solar wifi for cameras",
    "author": "Unlikely_Wombat10",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m03w7x/solar_wifi_for_cameras/",
    "score": 1,
    "num_comments": 1,
    "created_utc": "2025-07-15T00:48:46Z",
    "flair": null,
    "post_text": "Just wondering if anyone has used one of these solar 4g wifi modems and how they went. I want to set one up for a couple of solar wifi cameras and not sure if these would do the job or I need to make a better setup. \nAlso if anyone could also give me a few pointers on what to look for in a 12v 4g modem router. I have to be able to run it off solar as I don't have power at the moment.\nAny help or thoughts on this much is appreciated."
  },
  {
    "id": "1m00jn1",
    "title": "How to view VicoHome camera's past alerts? Using the app is best?",
    "author": "MsChiSox",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1m00jn1/how_to_view_vicohome_cameras_past_alerts_using/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-14T22:23:46Z",
    "flair": null,
    "post_text": "Hi, After the notification on my phone from the app has been closed (for a motion alert for example) - how do I find those recording clips? Thank you so much, this is new to me, VicoHome.\n\nEdited to add - if the alerts are older than a couple of days and I have the free plan - if I subscribe now to the extended plan in the cloud - will it retroactively make those prior ones viewable? Or, just more going forward? \n\nThanks!"
  },
  {
    "id": "1lzvrjr",
    "title": "Camera",
    "author": "Latter_Wolverine_627",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lzvrjr/camera/",
    "score": 3,
    "num_comments": 13,
    "created_utc": "2025-07-14T19:20:32Z",
    "flair": null,
    "post_text": "Does anyone have any advice so I want to put up a camera at my sons grave we know who’s doing the damaging and that, police won’t do anything unless they have it on video the graveyard is a 5 minute walk from me so I don’t have access to wifi or Bluetooth, does anyone have any suggestions on cameras that will work don’t want to go wasting money that’s doesn’t work if there is a camera that would work\nTIA."
  },
  {
    "id": "1lztqzd",
    "title": "Side Mount PTZ - Oriented to Side (not Down)",
    "author": "Sycamorepod",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lztqzd/side_mount_ptz_oriented_to_side_not_down/",
    "score": 1,
    "num_comments": 13,
    "created_utc": "2025-07-14T18:06:47Z",
    "flair": null,
    "post_text": "Is anyone aware of a side-mount/wall-mount PTZ where the the orientation is to the side, rather than down.  It would resemble a dome or turret mounted to wall, but be motorized to pan at 180 degrees and tilt at least 90.  "
  },
  {
    "id": "1lyyfga",
    "title": "Whole House Recommendations",
    "author": "Actual-Stand-4757",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lyyfga/whole_house_recommendations/",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-07-13T17:24:55Z",
    "flair": null,
    "post_text": "Hey all! New to the wireless security world and could use some help. Also, I’m not specifically worried about local storage or subscriptions. I’m am look a quality brand of camera for a wired doorbell, internal camera, and external camera. I have had a Ring doorbell in the past and enjoyed it and the app, but never had anything else Ring. I currently have a Blink doorbell and few camera, but despise the app and the reaction time for motion. Thanks!"
  },
  {
    "id": "1lyxo4o",
    "title": "Camera no audio or pan and tilt",
    "author": "bluemoon1333",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lyxo4o/camera_no_audio_or_pan_and_tilt/",
    "score": 1,
    "num_comments": 15,
    "created_utc": "2025-07-13T16:54:19Z",
    "flair": null,
    "post_text": "I live in a apartment and the rules are I can have a security camera inside my apartment but it can't have the ability to record audio and it can't be able to pan and tilt. Is there any simple wifi camera that has this ideally I'd be able to connect it to my Synology nas or the cloud so if I am robbed the footage is safe? "
  },
  {
    "id": "1ly9tvp",
    "title": "Security camera with a long battery life",
    "author": "Similar-Surround8113",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly9tvp/security_camera_with_a_long_battery_life/",
    "score": 0,
    "num_comments": 2,
    "created_utc": "2025-07-12T20:09:53Z",
    "flair": null,
    "post_text": "I'm looking for a camera with a battery life that lasts months or a wired one that is inconspicuous. I'm trying to place it on a cluttered vanity with the only outlet being behind the vanity. I also need it to stream to my phone and notify me when there's a person in the room like a ring doorbell but without the obnoxious noises. i really need it to be not noticeable."
  },
  {
    "id": "1ly7llv",
    "title": "PoE connection not working but tester shows the cable is OK",
    "author": "ezeaizen",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly7llv/poe_connection_not_working_but_tester_shows_the/",
    "score": 7,
    "num_comments": 16,
    "created_utc": "2025-07-12T18:33:59Z",
    "flair": null,
    "post_text": "I’m installing a Reolink Poe doorbell camera. \nI just run an Ethernet cable through the attic and put the connectors. The tester shows the cable is ok, but the camera shows disconnected on the NVR. \nI tested the camera with a short cable next to the NVR and the camera works perfectly.\nIs it possible that even if the tester shows everything that the cable is OK , something can still be wrong with it? "
  },
  {
    "id": "1ly62g7",
    "title": "What can I get for a single security camera that records 24/7 without a DVR setup?",
    "author": "Ramblewolf",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly62g7/what_can_i_get_for_a_single_security_camera_that/",
    "score": 4,
    "num_comments": 43,
    "created_utc": "2025-07-12T17:30:17Z",
    "flair": null,
    "post_text": "I'm trying to get a security camera setup for my room, Since I live with a questionable drug addict who I don't trust at all. I also lock my door, But have 1 day a week that I'm not able to do that, and want to make sure my stuff isnt stolen or tampered with. I've tried looking for different type of CCTV type cameras, But almost all the ones I've seen require a whole DVR setup. I just want 1 single camera that can constantly record, and save to an SD card or something similar, and to have the ability to set up my camera to wifi and check on it from my phone, or go back and watch the recording. Any recommendations?"
  },
  {
    "id": "1ly2hke",
    "title": "Is this a good install",
    "author": "Ok-Blacksmith-7021",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1ly2hke/is_this_a_good_install/",
    "score": 6,
    "num_comments": 51,
    "created_utc": "2025-07-12T14:58:58Z",
    "flair": null,
    "post_text": "I hired a guy to install a cctv outside of my home. He us plugging the cameras into existing outlets i have around my home. Is this a good job and the standard way of installing these things?\n\nMy concerns are 1. It looks bad. 2. It won't last long outside in the elements. 3. Anyone can just unplug my camera by going up to it.\n\nDid I just get a lazy guy or should I have specified I wanted a more professional job?"
  },
  {
    "id": "1lxyx22",
    "title": "Searching for a CCTV camera that offers clear audio to monitor the cashier in a noisy reception area.",
    "author": "Familiar_Tension_638",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lxyx22/searching_for_a_cctv_camera_that_offers_clear/",
    "score": 0,
    "num_comments": 8,
    "created_utc": "2025-07-12T12:10:21Z",
    "flair": null,
    "post_text": null
  },
  {
    "id": "1lxvi19",
    "title": "Looking for a security camera that can run off a power bank",
    "author": "WhatThisGirlSaid",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lxvi19/looking_for_a_security_camera_that_can_run_off_a/",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-07-12T08:30:44Z",
    "flair": null,
    "post_text": "I have a romoss sense 8p 30,000mah that I run some closet motion sensor lights for the front door and wondering if there is a cheap security camera I can attach to that just for simple motion detection people detection purely for delivery notification nothing else.. No other features needed besides maybe night detection\n\nNo recording or two way talk or any other fancy features required\n\nJust looking for the cheapest camera with no subscription fee required to notify me when someone opens my door to leave food inside the front door on my phone and desktop pc\n\nThere is no nearby mains power to the door unless I run an obstructive extension cable that's why trying to find a camera that can already use an existing power bank there\n\nNo ring or doorbell type cameras either as I will most likely be pointing it at the front door room rather than outside the door itself\n\nI might get a second camera to put on the window indoor to point outside to get a second feed of the front door in case people leave the delivery outside for example instead of inside the house\n\nSo what are some options for this"
  },
  {
    "id": "1lxlesm",
    "title": "Discreet visual and audio camera",
    "author": "lucybashh",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lxlesm/discreet_visual_and_audio_camera/",
    "score": 2,
    "num_comments": 8,
    "created_utc": "2025-07-11T23:16:15Z",
    "flair": null,
    "post_text": "Hi everyone,\n\nCan anyone please recommend a small spy camera that I can put anywhere in my front room that looks like an ornament, something no one wouldn’t notice at all if they looked twice at it?\n\nOne preferably that would only start recording if there was movement / sound and is a USB to wall plug chargeable that comes with an app i can downloaded to an app on my phone to save videos?\n\nThank you x"
  },
  {
    "id": "1lwxz7y",
    "title": "Need long distance NV security camera",
    "author": "goober2199",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwxz7y/need_long_distance_nv_security_camera/",
    "score": 1,
    "num_comments": 2,
    "created_utc": "2025-07-11T04:43:01Z",
    "flair": null,
    "post_text": "Hello. Im looking for a security camera to watch over my garden. I want it to have good night vision because that is when it's most vulnerable. I would need 100+ feet clear Night vision. Wifi, good battery / solar.\nI've been researching and looking online but im getting overwhelmed with all the options. Any insight is appreciated,  thank you\n"
  },
  {
    "id": "1lwwaco",
    "title": "Solar &amp; Cellular Outdoor Cameras",
    "author": "Relevant_Act2046",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwwaco/solar_cellular_outdoor_cameras/",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-07-11T03:12:58Z",
    "flair": null,
    "post_text": "I’m looking for an outdoor surveillance camera that would be good for a remote setting.\n\nNo wifi is available on this site and neither is electricity so I think a solar/cellular camera may be the best fit for this kind of application. Please advise if you have another suggestion. \n\nI know of Reolink and have installed a couple previously but their PIR motion detection isn’t the best and their night vision is worse. \n\nWhat other brands or models of cameras would you recommend for this kind of application? \n\nRequirements:\nReasonably priced\nSolar powered\nCellular based\nDecent night vision and motion detection.\n\nThank you hive mind."
  },
  {
    "id": "1lwuxxm",
    "title": "Can anyone identify this security camera?",
    "author": "Aviorwolf",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwuxxm/can_anyone_identify_this_security_camera/",
    "score": 0,
    "num_comments": 6,
    "created_utc": "2025-07-11T02:06:44Z",
    "flair": null,
    "post_text": "^(My neighbor put this up pointing at my backyard. Sorry for the poor photo quality!)\n\nhttps://preview.redd.it/2w0joshwk5cf1.jpg?width=1318&amp;format=pjpg&amp;auto=webp&amp;s=4699ac96e3b73e7b310f45c50c6aaf088311ec90\n\n"
  },
  {
    "id": "1lwrmfu",
    "title": "wifi mini hidden spy camera wireless hd 1080p",
    "author": "RepeatPlayful3779",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwrmfu/wifi_mini_hidden_spy_camera_wireless_hd_1080p/",
    "score": 0,
    "num_comments": 6,
    "created_utc": "2025-07-10T23:27:47Z",
    "flair": null,
    "post_text": "I found this camera at my house. I used Google Lens and it gave me the title above. Problem is I don't know what app to install on my android phone so I can view the camera. Anyone know? Please help. I've been trying to figure this out half of the day. I'm getting very frustrated. Thank y'all in advance. Feel free to add me."
  },
  {
    "id": "1lwqn3a",
    "title": "Lorex security cameras",
    "author": "EmeraldFireWolf",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwqn3a/lorex_security_cameras/",
    "score": 0,
    "num_comments": 0,
    "created_utc": "2025-07-10T22:45:32Z",
    "flair": null,
    "post_text": null
  },
  {
    "id": "1lwjtvf",
    "title": "24/7 Video recording review/“scrubbing”",
    "author": "yanksfold",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwjtvf/247_video_recording_reviewscrubbing/",
    "score": 1,
    "num_comments": 13,
    "created_utc": "2025-07-10T18:12:01Z",
    "flair": null,
    "post_text": "Is there a quality system that has ability to do “scrubbing” for review of video (vs viewing recorded clips)?   Nest does it well but I would prefer anything but Google!"
  },
  {
    "id": "1lwghes",
    "title": "Our AirBnb has these throughout the home with privacy shield open - what are they and how to tell if these are live?",
    "author": "BitcoinRigNoob",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwghes/our_airbnb_has_these_throughout_the_home_with/",
    "score": 287,
    "num_comments": 119,
    "created_utc": "2025-07-10T16:01:46Z",
    "flair": null,
    "post_text": "Airbnb has motion sensors with what looks like camera lens through the living areas, hallways etc. we've been here a few days and I didn't notice. \n\nAre these cameras or are they part of the motion sensor lens? Unsure - help appreciated. I've met the host and can't imagine her to do something sinister. "
  },
  {
    "id": "1lwf388",
    "title": "Mobotix jpg url on newer models Mx-VB1A-8-IR-VA",
    "author": "smhick",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwf388/mobotix_jpg_url_on_newer_models_mxvb1a8irva/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-10T15:06:45Z",
    "flair": null,
    "post_text": "We recently purchased a new Mx-VB1A-8-IR-VA and we were wondering how we can grab a still jpg image from the camera.\n\nOn our older Mobotix M15 camera we just used the following URL [http://192.168.1.1/record/current.jpg](http://192.168.1.1/record/current.jpg) and we see a still image from the camera\n\nBut testing this on the new Mx-VB1A-8-IR-VA camera doesn't seem to work\n\nNew camera IP is [192.168.1.2](http://192.168.1.2)\n\nTested\n\n[http://192.168.1.2/record/current.jpg](http://192.168.1.2/record/current.jpg)\n\nand get the following error Access Error: 404 -- Not Found\n\nI'm able to open up the mjpeg live stream no problem via the following URL\n\n[http://192.168.1.2/live/stream3](http://192.168.1.2/live/stream3)\n\nDoes the newer Mx-VB1A-8-IR-VA support grabbing jpg images from a URL?\n\nCamera Firmware version = &lt;mb20250619UX&gt;"
  },
  {
    "id": "1lwef1q",
    "title": "PoE doorbell cameras options",
    "author": "WishboneTemporary232",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lwef1q/poe_doorbell_cameras_options/",
    "score": 2,
    "num_comments": 3,
    "created_utc": "2025-07-10T14:39:26Z",
    "flair": null,
    "post_text": "Looking for a PoE doorbell camera. Are there any other options aside from Reolink?\n\nHoping to use with my Swann NVR."
  },
  {
    "id": "1lw56xs",
    "title": "Simple live camera suggestions?",
    "author": "KarnifalChimera",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lw56xs/simple_live_camera_suggestions/",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-07-10T05:57:15Z",
    "flair": null,
    "post_text": "Alright, I think this is the right place to ask this? I'm trying to find a basic camera to monitor my barn. I don't need any audio features, absolutely don't want to deal with a subscription, don't really need it to record anything. I just need to be able to look in frequently to check on them without walking out there at all hours, especially when I have girls expecting babies. Night vision would be important but motion detection is not, the animals would set it off every few minutes and that seems silly. It would be technically indoors (the barn is a concrete block building but it does have little screened vents at the top and bottom of two walls) so it won't get wet but it could get cold (just above freezing at the lowest). There is power out there in the form of a regular outlet (I run ac and fans in the summer) so I'd prefer a wired camera. The wifi does just about reach I believe but doing high demand things like video calls in there has had some crunchiness. I imagine that if its just sending video out, no audio, and not receiving anything back it should work? I'd look into cellular but I have a feeling that would be more expensive and I'm on a tighter budget with this. \n\nI did do some looking of my own at first but all the cheap cameras seem to require subscriptions and have all sorts of extra bells and whistles that really seem like overkill in this situation. I just need to know when one of the girls goes into labor or check in when I'm off the farm just in case. Any help here would be awesome!"
  },
  {
    "id": "1lw2uis",
    "title": "Altered with security cameras",
    "author": "chronosthetitan",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lw2uis/altered_with_security_cameras/",
    "score": 2,
    "num_comments": 0,
    "created_utc": "2025-07-10T03:41:33Z",
    "flair": null,
    "post_text": "I’ll be on my app and hear from the cameras but if you save the footage there’s no sound. Sometimes the cameras go out. Am I being WiFi jammed?"
  },
  {
    "id": "1lvxjy9",
    "title": "Best Way to Share Tapo C402 Camera Access with Immediate Family",
    "author": "bbgarnett",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvxjy9/best_way_to_share_tapo_c402_camera_access_with/",
    "score": 1,
    "num_comments": 3,
    "created_utc": "2025-07-09T23:21:52Z",
    "flair": null,
    "post_text": "I just ordered two TP-Link **Tapo SolarCam C402 Kits** and they’ll be arriving next week. Will be using them strictly with a Micro SD card and no cloud storage.  We're planning to install them at our family cabin so everyone can keep an eye on the place when we’re not there—mainly to monitor the garden, lake area, and any animals that might be getting into things. I was wondering if there’s any way to set the cameras up so I can give people a **link** to view the feed, **without requiring everyone to download the Tapo app**. Ideally, I’d like it to be **“public” in the sense that it's easily accessible** (like via a URL), but still **private so that only immediate family members can view it**—not just anyone with the link. If that’s not possible, is there at least a way for multiple people to have their own Tapo accounts and log in to view the cameras and or get notifications? Just looking for the simplest way to share access with family without making it a hassle. Thanks!"
  },
  {
    "id": "1lvt7xy",
    "title": "Continuous Live Stream Help",
    "author": "InsignificantUnit137",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvt7xy/continuous_live_stream_help/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-09T20:21:26Z",
    "flair": null,
    "post_text": "Hi everyone! I need some help. I work at a mall and we recently got a rooftop beehive. My boss wants a continuous live stream of the beehive to stream to a TV on the mall floor. The problem is that we don’t have a computer to run the stream so we need the feed to go from the camera straight to the TV somehow. We can buy a smart TV and weatherproof camera but are at a loss on what to get and how to actually set it up. None of us are very tech savvy, we just want a way to watch our bees! Any help is very appreciated!!! Thank you!"
  },
  {
    "id": "1lvr9x1",
    "title": "Blink outdoor 3/4 the right option?",
    "author": "Jay20W",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvr9x1/blink_outdoor_34_the_right_option/",
    "score": 1,
    "num_comments": 0,
    "created_utc": "2025-07-09T19:04:44Z",
    "flair": null,
    "post_text": "A friend of mine would like to put in some outdoor security at her barn. She’s looking to put in about 6 cameras total, all outside covering the exterior and pathways to her barn (she boards and trains horses) I was thinking she might like the Blink outdoor cameras because they are relatively simple, WiFi, enabled, motion activated and have IR for night time. My only concern is battery life. Trying to keep the overall bill under $500 and open to recommendations "
  },
  {
    "id": "1lvq24i",
    "title": "Non-subscription, closed network options?",
    "author": "WARowland",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvq24i/nonsubscription_closed_network_options/",
    "score": 4,
    "num_comments": 2,
    "created_utc": "2025-07-09T18:17:26Z",
    "flair": null,
    "post_text": "Looking for a home system with wireless cameras, but that I can set up without an internet connection? Just not sure if there's anything out there like it. \n\nBasically, is there a system that let's me connect the cameras to a non-internet wifi network (basically a router with no-modem) and transfer footage to an offline central storage hub that way (like an computer or harddrive also on the network)\n\nWould a normal wifi-camera set up allow me to do that?\n\nSorry if the question doesn't quite make sense. Im just not familiar enough with the industry to know what terminology to even look for. I've been hesitant to look at home secuirty systems because I don't like the idea of someone potentially being able to get into my home Internet wifi, and access the system from the internet (yes, I'm paranoid).\n\nFigure with a non-internet connected wifi, at least someone would have to be phsycially close to try to get in.\n\nThoughts? Ideas? "
  },
  {
    "id": "1lvmgnx",
    "title": "Wireless/Solar + 4G/LTE Outdoor Security Cameras for 5-Building Industrial Park – Recommendations?",
    "author": "Hungry_Coconut930",
    "url": "https://www.reddit.com/r/SecurityCamera/comments/1lvmgnx/wirelesssolar_4glte_outdoor_security_cameras_for/",
    "score": 2,
    "num_comments": 1,
    "created_utc": "2025-07-09T15:57:42Z",
    "flair": null,
    "post_text": "We’ve looked at Reolink Go/Go PT Plus, Arlo Go 2, and Eufy 4G Cam S330, but real-world feedback would help. Budget is flexible for reliability.\n\nWhat works well for you? \nWe would need roughly 4-6 cameras. \n\nThanks in advance! "
  }
]